# * -- utf-8 -- *    # python3
# Author: Tang   Time:2018/4/17

i = int(input('净利润：'))
if i >1000000:
    a = 0.01*(i-1000000)+400000*0.015+200000*0.03+200000*0.05+100000*0.075+100000*0.1
    print(a)
elif i<=1000000 and i > 600000:
    b = (i-600000)*0.015+200000*0.03+200000*0.05+100000*0.075+100000*0.1
    print(b)
elif i<=600000 and i> 400000:
    c = (i-400000)*0.03+200000*0.05+100000*0.075+100000*0.1
    print(c)
elif i<=400000 and i>200000:
    d = (i-200000)*0.05+100000*0.075+100000*0.1
    print(d)
elif i<=200000 and i>=100000:
    e = (i-100000)*0.075+100000*0.1
    print(e)
elif i <10000:
    f = i*0.1
    print(f)
'''润(I)低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
20万到40万之间时，高于20万元的部分，可提成5%；
40万到60万之间时高于40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成. 
提问：从键盘输入当月利润I，求应发放奖金总数？'''